# Завдання 1

In [46]:
import pandas as pd

1. Завантажте з.csv файлів americas_2011.csv, americas_2012.csv, asia_2000_2015.csv інфо
до датафреймів df_11, df_12, df_as

In [47]:
df_11 = pd.read_csv('americas_2011.csv')
df_12 = pd.read_csv('americas_2012.csv')
df_as = pd.read_csv('asia_2000_2015.csv')

2. Виконайте конкатенацію датафреймів df_11, df_12 для отримання трьох результатів
(result_am)

In [48]:
result_am = pd.concat([df_11.set_index('Country'), df_12.set_index('Country')], keys=[2011, 2012])
result_am

                2011    2012
     Country
2011 Canada   1700.0     NaN
     Chile    2047.4     NaN
     Mexico   2250.2     NaN
     USA      1786.0     NaN
2012 Canada      NaN  1713.0
     Chile       NaN  2024.0
     Mexico      NaN  2225.8
     USA         NaN  1789.0

In [49]:
result_am = pd.concat([df_11.drop(columns='Country'), df_12.drop(columns='Country')], axis=0, ignore_index=True)
result_am

     2011    2012
0  1700.0     NaN
1  2047.4     NaN
2  2250.2     NaN
3  1786.0     NaN
4     NaN  1713.0
5     NaN  2024.0
6     NaN  2225.8
7     NaN  1789.0

In [50]:
result_am = pd.concat([df_11.set_index('Country'), df_12.set_index('Country')], axis=1)
result_am

           2011    2012
Country
Canada   1700.0  1713.0
Chile    2047.4  2024.0
Mexico   2250.2  2225.8
USA      1786.0  1789.0

3. Виконайте конкатенацію датафреймів result_am і df_as для отримання таких результатів:

In [51]:
years = [str(y) for y in range(2000, 2016)]

result_am = pd.concat( [df_11.set_index("Country"), df_12.set_index("Country")], axis=1)
df_as = df_as.set_index('Country')[years]
result_am = result_am.reindex(columns=years)

df_as['Region'] = 'Asia'
result_am['Region'] = 'America'

result = pd.concat([df_as, result_am])
result = result.set_index('Region', append=True).reorder_levels(['Region', 'Country'])
result

                   2000    2001    2002    2003    2004    2005    2006  \
Region  Country
Asia    Israel   2017.0  1979.0  1993.0  1974.0  1942.0  1931.0  1919.0
        Japan    1821.0  1809.0  1798.0  1799.0  1787.0  1775.0  1784.0
        Korea    2512.0  2499.0  2464.0  2424.0  2392.0  2351.0  2346.0
        Russia   1982.0  1980.0  1982.0  1993.0  1993.0  1989.0  1998.0
America Canada      NaN     NaN     NaN     NaN     NaN     NaN     NaN
        Chile       NaN     NaN     NaN     NaN     NaN     NaN     NaN
        Mexico      NaN     NaN     NaN     NaN     NaN     NaN     NaN
        USA         NaN     NaN     NaN     NaN     NaN     NaN     NaN

                   2007    2008    2009    2010    2011    2012    2013  \
Region  Country
Asia    Israel   1931.0  1929.0  1927.0  1918.0  1920.0  1910.0  1867.0
        Japan    1785.0  1771.0  1714.0  1733.0  1728.0  1745.0  1734.0
        Korea    2306.0  2246.0  2232.0  2187.0  2090.0  2163.0  2079.0
        Russia   1999.0  1997.0  1974.0  1976.0  1979.0  1982.0  1980.0
America Canada      NaN     NaN     NaN     NaN  1700.0  1713.0     NaN
        Chile       NaN     NaN     NaN     NaN  2047.4  2024.0     NaN
        Mexico      NaN     NaN     NaN     NaN  2250.2  2225.8     NaN
        USA         NaN     NaN     NaN     NaN  1786.0  1789.0     NaN

                   2014    2015
Region  Country
Asia    Israel   1853.0  1858.0
        Japan    1729.0  1719.0
        Korea    2124.0  2113.0
        Russia   1985.0  1978.0
America Canada      NaN     NaN
        Chile       NaN     NaN
        Mexico      NaN     NaN
        USA         NaN     NaN

In [52]:
df_as = pd.read_csv('asia_2000_2015.csv')

In [53]:
result_am = pd.concat([df_11.set_index("Country"), df_12.set_index("Country")], axis=1)
df_as = df_as[['Country', '2011', '2012']].set_index('Country')
result = pd.concat([df_as, result_am])
result

           2011    2012
Country
Israel   1920.0  1910.0
Japan    1728.0  1745.0
Korea    2090.0  2163.0
Russia   1979.0  1982.0
Canada   1700.0  1713.0
Chile    2047.4  2024.0
Mexico   2250.2  2225.8
USA      1786.0  1789.0

# Завдання 2

4. Завантажити дані з .csv файлів south_america_2000_2010.csv,
north_america_2000_2010.csv в датафрейми df_sa, df_na.

In [54]:
df_sa = pd.read_csv('south_america_2000_2010.csv')
df_na = pd.read_csv('north_america_2000_2010.csv')

5. Використовуючи метод append(), виконати об'єднання датафреймів для отримання
такого результату

In [55]:
pd.concat([df_na.set_index("Country"), df_sa.set_index("Country")])

,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
Country,,,,,,,,,,,
Canada,1779.0,1771.0,1754.0,1740.0,1760.0,1747,1745.0,1741.0,1735,1701.0,1703.0
Mexico,2311.2,2285.2,2271.2,2276.5,2270.6,2281,2280.6,2261.4,2258,2250.2,2242.4
USA,1836.0,1814.0,1810.0,1800.0,1802.0,1799,1800.0,1798.0,1792,1767.0,1778.0
Chile,2263.0,2242.0,2250.0,2235.0,2232.0,2157,2165.0,2128.0,2095,2074.0,2069.6

6. Завантажити дані з csv файлів americas_2011.csv, americas_2012.csv у датафрейми
df_a11, df_na12.

In [56]:
df_a11 = pd.read_csv('americas_2011.csv')
df_na12 = pd.read_csv('americas_2012.csv')

7. Використовуючи pd.merge(), виконати об'єднання датафреймів для отримання такого
результату

In [57]:
merged = pd.merge(df_na12, df_a11)
merged

  Country    2012    2011
0  Canada  1713.0  1700.0
1   Chile  2024.0  2047.4
2  Mexico  2225.8  2250.2
3     USA  1789.0  1786.0

8. Завантажити дані з csv файлу asia_2000_2015.csv в датафрейм df_as

In [58]:
df_as = pd.read_csv('asia_2000_2015.csv')
df_as

,Country,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,Israel,2017,1979,1993,1974,1942,1931,1919,1931,1929,1927,1918,1920,1910,1867,1853,1858
1,Japan,1821,1809,1798,1799,1787,1775,1784,1785,1771,1714,1733,1728,1745,1734,1729,1719
2,Korea,2512,2499,2464,2424,2392,2351,2346,2306,2246,2232,2187,2090,2163,2079,2124,2113
3,Russia,1982,1980,1982,1993,1993,1989,1998,1999,1997,1974,1976,1979,1982,1980,1985,1978

9. Створити датафрейм (на основі словнику) df_areas для зберігання інформації про
площі різних країн

In [59]:
data = {
    'Area': [17100000, 100210, 20770, 3287000],
    'Country': ['Russia', 'Korea', 'Israel', 'India']
}
df_areas = pd.DataFrame(data)
df_areas

       Area Country
0  17100000  Russia
1    100210   Korea
2     20770  Israel
3   3287000   India

10.Використовуючи pd.merge() з‘on’ ключовим словом виконати об'єднання датафреймів
для отримання такого результата

In [60]:
merged_area = pd.merge(df_areas, df_as, on='Country')
merged_area

,Area,Country,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,17100000,Russia,1982,1980,1982,1993,1993,1989,1998,1999,1997,1974,1976,1979,1982,1980,1985,1978
1,100210,Korea,2512,2499,2464,2424,2392,2351,2346,2306,2246,2232,2187,2090,2163,2079,2124,2113
2,20770,Israel,2017,1979,1993,1974,1942,1931,1919,1931,1929,1927,1918,1920,1910,1867,1853,1858

11.Створіть датафрейм (на основі словника) df_population для збереження інформації про
чисельність населення різних країн

In [61]:
data = {
    'Population': [10, 1002310, 207730, 3287000],
    'Country': ['Russia', 'Korea', 'Israel', 'India']
}
df_population = pd.DataFrame(data)
df_population

   Population Country
0          10  Russia
1     1002310   Korea
2      207730  Israel
3     3287000   India

12.Використовуючи pd.merge() з 'on' кл.словом виконати об'єднання датафреймів для отримання наступного результату

In [62]:
merged_area = pd.merge(merged_area, df_population, on='Country')
merged_area

,Area,Country,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,Population
0,17100000,Russia,1982,1980,1982,1993,1993,1989,1998,1999,1997,1974,1976,1979,1982,1980,1985,1978,10
1,100210,Korea,2512,2499,2464,2424,2392,2351,2346,2306,2246,2232,2187,2090,2163,2079,2124,2113,1002310
2,20770,Israel,2017,1979,1993,1974,1942,1931,1919,1931,1929,1927,1918,1920,1910,1867,1853,1858,207730

# Завдання 3

1. Перегляньте набори даних abbrevs, pop, area: state-abbrevs_my.csv, state-areas_my.csv,
state-pop_my.csv, використовуючи функцію read_csv() Pandas і функцію head().

In [63]:
abbrevs = pd.read_csv('state-abbrevs_my.csv')
pop = pd.read_csv('state-areas_my.csv')
area = pd.read_csv('state-pop_my.csv')

In [64]:
abbrevs.head()

  state;abbreviation
0         Alabama;AL
1          Alaska;AK
2         Arizona;AZ
3        Arkansas;AR
4      California;CA

In [65]:
pop.head()

  state;area (sq. mi)
0       Alabama;52423
1       Alaska;656425
2      Arizona;114006
3      Arkansas;53182
4   California;163707

In [66]:
area.head()

  state/region;ages;year;population
0           AL;under18;2012;1117489
1             AL;total;2012;4817528
2           AL;under18;2010;1130966
3             AL;total;2010;4785570
4           AL;under18;2011;1125763

2. Виконайте злиття «багато до одного» (назвіть новий датафрейм merged) і отримайте
повну назву штату в датафреймі population (використовуйте how=?, щоб
переконатися, що дані не викидаються через невідповідність міток). Перевірте
результат за допомогою head(). Видаліть зайвий стовпець «abbreviation».

In [67]:
import pandas as pd

pop = pd.read_csv('state-pop_my.csv', sep=';')
areas = pd.read_csv('state-areas_my.csv', sep=';')
abbrevs = pd.read_csv('state-abbrevs_my.csv', sep=';')

In [68]:
merged = pd.merge(
    pop,
    abbrevs,
    how='outer',
    left_on='state/region',
    right_on='abbreviation'
)
merged = merged.drop(columns=['abbreviation'])
merged.head()

  state/region     ages  year  population   state
0           AK    total  1990    553290.0  Alaska
1           AK  under18  1990    177502.0  Alaska
2           AK    total  1992    588736.0  Alaska
3           AK  under18  1991    182180.0  Alaska
4           AK  under18  1992    184878.0  Alaska

3. Перевірте, чи були якісь невідповідності. Для цього можна шукати рядки з нульовими
значеннями (за допомогою методу isnull().any())

In [69]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

4. Деякі зі стовпців містять значення null; з’ясуйте, які саме (використовуйте isnull(),
head())

In [70]:
merged[merged.isnull().any(axis=1)].head()

     state/region     ages  year  population state
1872           PR  under18  1990         NaN   NaN
1873           PR    total  1990         NaN   NaN
1874           PR    total  1991         NaN   NaN
1875           PR  under18  1991         NaN   NaN
1876           PR    total  1993         NaN   NaN

5. Деякі з нових записів штатів також є нульовими, що означає, що не було відповідного
запису в abbrevs. З’ясуйте, в яких регіонах не вистачає цієї відповідності (за
допомогою індексатора loc виберіть стовпець, необхідний для перевірки,
використовуйте isnull(), вкажіть стовпець, необхідний для виведення, використовуйте
метод unique() – в 1 клітинку)

In [71]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

6. Дані про населення (pop) включають 2 записи (результат попереднього кроку) які не
відображаються в ключі абревіатури штатів. Треба виправити це, заповнивши
відповідні записи (використовуйте індексатор loc, щоб вибрати та призначити нові
значення)

In [72]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

7. Більше нулів у стовпці ‘state’ немає. Об’єднайте результат з даними про площу.

In [73]:
merged = pd.merge(
    merged,
    areas,
    how='outer'
)
merged.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

8. Перевірте нулі, щоб побачити, чи були якісь невідповідності

In [74]:
merged.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

# Завдання 4

1. Виберіть підмножини даних (кінцевий набір даних (дані штатів США) з попередньої
теми) на основі стовпця «штат/регіон». Виведіть кількість спостережень у кожній
групі.

In [75]:
merged.count()

state/region     2544
ages             2544
year             2544
population       2524
state            2544
area (sq. mi)    2496
dtype: int64

2. Обчисліть середнє значення населення для кожного штату.

In [76]:
mean = merged.groupby('state')['population'].mean()
mean

state
Alabama                 2.797862e+06
Alaska                  4.164389e+05
Arizona                 3.337577e+06
Arkansas                1.686640e+06
California              2.170908e+07
Colorado                2.727803e+06
Connecticut             2.128442e+06
Delaware                4.979201e+05
District of Columbia    3.496533e+05
Florida                 1.008313e+07
Georgia                 5.285421e+06
Hawaii                  7.781240e+05
Idaho                   8.576250e+05
Illinois                7.757703e+06
Indiana                 3.838380e+06
Iowa                    1.831789e+06
Kansas                  1.703569e+06
Kentucky                2.536397e+06
Louisiana               2.811572e+06
Maine                   7.906852e+05
Maryland                3.357502e+06
Massachusetts           3.891187e+06
Michigan                6.157709e+06
Minnesota               3.108525e+06
Mississippi             1.794283e+06
Missouri                3.522333e+06
Montana                 5.716055e+05
Nebraska                1.087942e+06
Nevada                  1.310279e+06
New Hampshire           7.675910e+05
New Jersey              5.227053e+06
New Mexico              1.175271e+06
New York                1.171282e+07
North Carolina          5.140725e+06
North Dakota            4.066764e+05
Ohio                    7.079279e+06
Oklahoma                2.192022e+06
Oregon                  2.146920e+06
Pennsylvania            7.615765e+06
Puerto Rico             2.367490e+06
Rhode Island            6.390411e+05
South Carolina          2.569703e+06
South Dakota            4.840280e+05
Tennessee               3.579156e+06
Texas                   1.381758e+07
United States           1.782390e+08
Utah                    1.536009e+06
Vermont                 3.735618e+05
Virginia                4.494164e+06
Washington              3.747736e+06
West Virginia           1.114171e+06
Wisconsin               3.371227e+06
Wyoming                 3.212865e+05
Name: population, dtype: float64

3. Виведіть мінімальне значення населення для кожного штату та року.

In [77]:
min = merged.groupby(['state', 'year'])['population'].min()
min

state    year
Alabama  1990    1050041.0
         1991    1060794.0
         1992    1072873.0
         1993    1085606.0
         1994    1097180.0
                   ...
Wyoming  2009     134960.0
         2010     135351.0
         2011     135407.0
         2012     136526.0
         2013     137679.0
Name: population, Length: 1272, dtype: float64

4. Виберіть підмножини даних на основі стовпця «рік». Обчисліть суму населення за кожен
рік.

In [78]:
sum = merged.groupby('year')['population'].sum()
sum

year
1990    627682652.0
1991    636587920.0
1992    646046816.0
1993    655027066.0
1994    663533524.0
1995    671503086.0
1996    679255606.0
1997    687135340.0
1998    694571044.0
1999    701972464.0
2000    713976868.0
2001    720176600.0
2002    726012052.0
2003    731294092.0
2004    737068863.0
2005    742921345.0
2006    749079009.0
2007    755257832.0
2008    761103707.0
2009    766472596.0
2010    771509855.0
2011    775525479.0
2012    779657013.0
2013    783858576.0
Name: population, dtype: float64

5. За допомогою методу aggregate() виведіть медіану, стандартне та максимальне
значення для кожного штату.

In [79]:
stats = merged.groupby('state')['population'].aggregate(['median', 'std', 'max'])
stats

                           median           std          max
state
Alabama                 2592491.0  1.712509e+06    4833722.0
Alaska                   372963.0  2.349527e+05     735132.0
Arizona                 2656374.0  2.093351e+06    6626624.0
Arkansas                1534266.5  1.025828e+06    2959373.0
California             19689006.0  1.288952e+07   38332521.0
Colorado                2272775.0  1.702535e+06    5268367.0
Connecticut             2071541.0  1.328675e+06    3596080.0
Delaware                 437890.0  3.134898e+05     925749.0
District of Columbia     344426.0  2.404787e+05     646449.0
Florida                 8532202.5  6.646536e+06   19552860.0
Georgia                 4501743.0  3.225371e+06    9992167.0
Hawaii                   712352.0  4.863902e+05    1404054.0
Idaho                    720672.5  5.027190e+05    1612136.0
Illinois                7349130.0  4.672268e+06   12882135.0
Indiana                 3584646.0  2.318553e+06    6570902.0
Iowa                    1757177.5  1.119580e+06    3090416.0
Kansas                  1604539.0  1.012639e+06    2893957.0
Kentucky                2358863.5  1.563825e+06    4395295.0
Louisiana               2735822.0  1.648987e+06    4625470.0
Maine                    771644.5  5.023038e+05    1330509.0
Maryland                3091610.0  2.065334e+06    5928814.0
Massachusetts           3761749.0  2.476977e+06    6692824.0
Michigan                5953716.5  3.711610e+06   10055315.0
Minnesota               2840559.0  1.877168e+06    5420380.0
Mississippi             1677279.5  1.050380e+06    2991207.0
Missouri                3280113.0  2.149396e+06    6044171.0
Montana                  518746.5  3.506990e+05    1015165.0
Nebraska                1023004.0  6.483032e+05    1868516.0
Nevada                   943368.0  8.808592e+05    2790136.0
New Hampshire            711336.0  4.792530e+05    1323459.0
New Jersey              4946007.0  3.237715e+06    8899339.0
New Mexico              1020168.5  6.914405e+05    2085287.0
New York               11354079.0  7.297249e+06   19651127.0
North Carolina          4474810.5  3.255546e+06    9848060.0
North Dakota             403960.5  2.504543e+05     723393.0
Ohio                    6880768.5  4.310862e+06   11570808.0
Oklahoma                2047926.0  1.319689e+06    3850568.0
Oregon                  1863284.5  1.348440e+06    3930065.0
Pennsylvania            7422769.5  4.807634e+06   12773801.0
Puerto Rico             2352074.5  1.424050e+06    3826878.0
Rhode Island             627342.5  4.079193e+05    1074579.0
South Carolina          2290566.5  1.593155e+06    4774839.0
South Dakota             452772.0  2.858154e+05     844877.0
Tennessee               3194791.0  2.232607e+06    6495978.0
Texas                  12049370.5  8.142716e+06   26448193.0
United States         161878490.5  1.088570e+08  316128839.0
Utah                    1313906.0  8.337307e+05    2900872.0
Vermont                  358144.0  2.356350e+05     626630.0
Virginia                4040709.5  2.819406e+06    8260405.0
Washington              3249419.0  2.319298e+06    6971406.0
West Virginia           1114672.5  7.170100e+05    1856680.0
Wisconsin               3137501.0  2.056130e+06    5742713.0
Wyoming                  295711.5  1.929180e+05     582658.0

6. За допомогою методу filter() виведіть 10 перших груп, у яких стандартне відхилення
сукупності більше за X.

In [89]:
X = 1_000_000
filtered = merged.groupby('state').filter(lambda x: x['population'].std() >= X)['state']
filtered.unique()[:10]

array(['Alabama', 'Arizona', 'Arkansas', 'California', 'Colorado',
       'Connecticut', 'Florida', 'Georgia', 'Illinois', 'Indiana'],
      dtype=object)

7. Використовуючи метод filter() і лямбда-функції, виведіть назву штатів які брали
участь у наборі даних 5 або більше разів.

In [40]:
filtered = merged.groupby('state').filter(lambda x: len(x) >= 5)['state'].unique()
filtered

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Puerto Rico', 'Rhode Island', 'South Carolina', 'South Dakota',
       'Tennessee', 'Texas', 'United States', 'Utah', 'Vermont',
       'Virginia', 'Washington', 'West Virginia', 'Wisconsin', 'Wyoming'],
      dtype=object)